* Loading database dumps
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database exercise7
:END:

** Write a SQL statement that returns all rows in the films table.
#+begin_src sql
  SELECT * FROM films
#+end_src

#+RESULTS:
| title            | year | genre    |
|------------------+------+----------|
| Die Hard         | 1988 | action   |
| Casablanca       | 1942 | drama    |
| The Conversation | 1974 | thriller |

** Write a SQL statement that returns all rows in the films table with a title shorter than 12 letters.

#+begin_src sql
    SELECT * FROM films
    WHERE length(title) < 12
#+end_src

#+RESULTS:
| title      | year | genre  |
|------------+------+--------|
| Die Hard   | 1988 | action |
| Casablanca | 1942 | drama  |

** Write the SQL statements needed to add two additional columns to the films table: director, which will hold a director's full name, and duration, which will hold the length of the film in minutes.
#+begin_src sql
    ALTER TABLE films
    ADD COLUMN director varchar(100),
    ADD COLUMN duration int;
#+end_src

#+RESULTS:
| ALTER TABLE |
|-------------|

** Write SQL statements to update the existing rows in the database with values for the new columns:

#+BEGIN_SRC sql
  UPDATE films SET duration = 132 WHERE title = 'Die Hard';
  UPDATE films SET director = 'John McTiernan' WHERE title = 'Die Hard';
  UPDATE films SET duration = 102 WHERE title = 'Casablanca';
  UPDATE films SET director = 'Michael Curtiz' WHERE title = 'Casablanca';
  UPDATE films SET duration = 113 WHERE title = 'The Conversation';
  UPDATE films SET director = 'Francis Ford Coppola' WHERE title = 'The Conversation';
#+END_SRC

#+RESULTS:
| UPDATE 1 |
|----------|
| UPDATE 1 |
| UPDATE 1 |
| UPDATE 1 |
| UPDATE 1 |
| UPDATE 1 |

** Write SQL statements to insert the following data into the films table:


#+BEGIN_SRC sql
    INSERT INTO films (title, YEAR, genre, director, duration)
    VALUES
    ('1984', 1956, 'scifi', 'Michael Anderson', 90),
    ('Tinker Tailor Soldier Spy', 2011, 'espionage', 'Tomas Alfredson', 127),
    ('The Birdcage', 1996, 'comedy', 'Mike Nichols', 118);
#+END_SRC

#+RESULTS:
| INSERT 0 3 |
|------------|

** Write a SQL statement that will return the title and age in years of each movie, with newest movies listed first:

#+BEGIN_SRC sql
  SELECT title, (EXTRACT(year FROM current_date) - year) AS age FROM films
  ORDER BY age;
#+END_SRC

#+RESULTS:
| title                     | age |
|---------------------------+-----|
| Tinker Tailor Soldier Spy |  10 |
| The Birdcage              |  25 |
| Die Hard                  |  33 |
| The Conversation          |  47 |
| 1984                      |  65 |
| Casablanca                |  79 |


** Write a SQL statement that will return the title and duration of each movie longer than two hours, with the longest movies first.

#+BEGIN_SRC sql
    SELECT title, duration FROM films
    WHERE duration > 120
    ORDER BY duration DESC;
#+END_SRC

#+RESULTS:
| title                     | duration |
|---------------------------+----------|
| Die Hard                  |      132 |
| Tinker Tailor Soldier Spy |      127 |


** Write a SQL statement that returns the title of the longest film.


#+BEGIN_SRC sql
    SELECT title FROM films
    ORDER BY duration DESC
    LIMIT 1;
#+END_SRC

#+RESULTS:
| title    |
|----------|
| Die Hard |
